# Comments

# ال compiler بيقرا كل سطر مكتوب عندي في ال code 
# طيب لو انا عايز ال compiler ميترجمش سطر معين الي لغة الالة اعمل ايه ؟
# هنا انا بستخدم ال comments 
# بمعني ان ال comment بيخفي عن ال compiler الاسطر اللي انا مش عايزه يترجمها الي لغة الالة 
# بالظبط زي ما انا بكتب حاليا كدا 
# كل الاسطر اللي انا كاتبها دي ال compiler مستحيل يشوفها


# طيب سؤال: ايه فايدة ال comments دي ؟
# 1- ممكن استخدمها زي ما انا بعمل دلوقتي .. بمعني انا بكتب notes ليا او لاي حد هيدخل علي ال repo ده عشان يتعلم الاساسيات
# 2- لو بتشتغل في شركة ما ف انك تكتب comments ده امر جدا مهم عشان انت مش بتشغل وحدك علي ال project ده
# ولازم تكتب comment عشان توضح للباشمهندس اللي هيستلم بعدك الكود ده بيعمل ايه ؟

