# String

# لو انا عندي رسالة ترحيب عايز اطبعها
name = "Ahmed"
print("Hello Ahmed")
# طيب انا ليه عامل متغير name ومديها ahmed طالما انا هكتب ahmed بنفسي 
# بالاضافة اني مثلا هاجي اغير الاسم فوقتها انا هحتاج اغيره مرتين, مرة في المتغير ومرة في مرحلة الطباعة 
print("Hello " + name) # ==> Hello Ahmed
# طيب هنا Hello دي string وكمان name هنا مخزن في داخله string 
# في المرحلة دي عادي نجمع الاتنين ببعض ووقتها هيكون علامة ال (+) اسمها concatenation 
# بس طبعا هنا الجمع بين string و string 
# لكن مينفعش يجمع بين string و integer

####################################################

# لو انا عايز اطبع ahmed بس داخل العلامتين دول "" 
print('"Ahmed"') # ==> "Ahmed"
print("\"Ahmed\"") # ==> "Ahmed" 
# (\) دي اسمها backslash ودي بتوضح لل compiler ان الحرف اللي بعدها هيكون مقروء كنص يتطبع مع Ahmed

#####################################################

print("Hello\n my name is Ahmed");

# (\n) دي معناها new line بمعني ان الكلام اللي بعدها هينزل ويتطبع في سطر جديد
# Hello
# my name is Ahmed
